In [3]:
import mysql.connector
import pandas as pd

In [8]:
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    passwd = 'root',
    database = 'sakila'
)

In [9]:
mycursor = mydb.cursor()
def sql_df(yourQuery):
    mycursor.execute(yourQuery)
    myresult = mycursor.fetchall()
    df = pd.DataFrame(myresult, columns=mycursor.column_names)
    return df

In [10]:
sql_df(
    'show tables;'
)

              Tables_in_sakila
0                        actor
1                   actor_info
2                      address
3                     category
4                         city
5                      country
6                     customer
7                customer_list
8                         film
9                   film_actor
10               film_category
11                   film_list
12                   film_text
13                   inventory
14                    language
15  nicer_but_slower_film_list
16                     payment
17                      rental
18      sales_by_film_category
19              sales_by_store
20                       staff
21                  staff_list
22                       store

In [26]:
# soal nomor 1
sql_df(
    'SELECT TITLE, LENGTH FROM FILM ORDER BY LENGTH ASC LIMIT 10;'
)

                 TITLE  LENGTH
0  RIDGEMONT SUBMARINE      46
1            IRON MOON      46
2         ALIEN CENTER      46
3     LABYRINTH LEAGUE      46
4        KWAI HOMEWARD      46
5      DOWNHILL ENOUGH      47
6       HALLOWEEN NUTS      47
7       HANOVER GALAXY      47
8      DIVORCE SHINING      47
9           HAWK CHILL      47

In [45]:
# soal nomor 2
sql_df(
    'select name as category from category;'
)

       category
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

In [52]:
sql_df('select rental_id, avg(amount) as rataHargaSewa from payment group by rental_id;')

       rental_id rataHargaSewa
0            NaN      1.990000
1            1.0      2.990000
2            2.0      2.990000
3            3.0      3.990000
4            4.0      4.990000
...          ...           ...
16040    16045.0      0.990000
16041    16046.0      0.990000
16042    16047.0      0.990000
16043    16048.0      8.990000
16044    16049.0      3.990000

[16045 rows x 2 columns]

In [53]:
# soal nomor 3
sql_df(
    'select actor_id, first_name, last_name from actor;'
)

     actor_id first_name     last_name
0           1   PENELOPE       GUINESS
1           2       NICK      WAHLBERG
2           3         ED         CHASE
3           4   JENNIFER         DAVIS
4           5     JOHNNY  LOLLOBRIGIDA
..        ...        ...           ...
195       196       BELA        WALKEN
196       197      REESE          WEST
197       198       MARY        KEITEL
198       199      JULIA       FAWCETT
199       200      THORA        TEMPLE

[200 rows x 3 columns]

In [57]:
# soal nomor 4